var train = ["侯硐貓村","內灣老街","十分瀑布","十分老街","台東鐵道藝術村","台泥DAKA園區","國立科學工藝博物館","大甲鎮瀾宮","奇美博物館","客家圓樓","崎頂子母隧道","扇形車庫","星巴克新豐門市","林先生廟","橋頭糖廠","櫻木平交道","水里蛇窯","池上飯包文化故事館","海洋科技博物館","深澳鐵道自行車","湯圍溝溫泉公園","玉里舊鐵橋","福井食堂","福隆海水浴場","羅東林業文化園區","臺中舊火車站","菁桐老街","蓮池潭","赤崁樓","鐵道部園區","阿里山森林鐵路車庫園區"];
var infor1 = ["貓村一帶自早期便有許多貓咪棲息，再加上貓群的繁殖力強，造就此處棲息了上百隻的貓咪，被美國CNN評選為「世界六大賞貓景點」2013年3月30日新貓橋改造落成，耗資一千八百萬新台幣竣工，結合貓咪及礦業等元素、富有童趣，外型意象是一隻咖啡色的貓，功能除原本連接光復里民進出聯外通路外，橋上更增加貓跳台，遊客可放置貓飼料餵食，為全台灣首例、全球唯一的「人貓共用天橋」<br><br>交通方式：台鐵宜蘭線侯硐車站旁",
"位於新竹縣橫山鄉，昔日內灣老街是進出盛產林木及礦產的尖石山區的最主要道，當地居民以客家族群為主，近年來以懷舊的老街情懷包含了內灣車站、內灣戲院以及內灣吊橋等等成為新竹的觀光旅遊景點。<br><br>交通方式：台鐵內灣線內灣車站徒步100公尺<br>住址：新竹縣橫山鄉光復路",
"位於新北市平溪區，在平溪線鐵路大華車站與十分車站之間，屬幕簾式瀑布，瀑布下方水潭極深，瀑布就像千軍萬馬奔騰，傾瀉而下，感覺就像一襲白色綢緞，墜入一大片寬廣深潭，瀑水形成的水氣經常彌漫在瀑潭上方，經陽光照射，便呈現出一道彩虹，顯現出晴空霓虹璀燦奪目，故有彩虹淵的美名。十分瀑布因岩層的傾向與水流相反，屬於逆斜層瀑布，此情況與北美的尼加拉瀑布相似，使其贏得「臺灣尼加拉瀑布」的美譽。<br><br>交通方式：台鐵平溪線十分車站徒步1.2公里",
"十分是天燈的發源地，早年於前清年間十分地區鬧過土匪，由於地處山區，所以村民都向山中逃過，等待土匪走後，留守在村中的人，就在夜間施放天燈做為信號告知山上避難的村民，可以下山回家了，也藉此種方式向村民報平安。 由於當日由山上避難回家的日子，正是農曆正月十五即是元宵節，從此以後，每年的元宵節，十分地區的村民便以放天燈的儀式來慶祝，且向鄰村的村民互報平安。回溯平溪礦業史，平溪區的十分，堪稱開發最早，也是規模最大的聚落。主要的特色在於這裡的老街是和火車鐵軌並存相連的。<br><br>交通方式：台鐵平溪線十分車站外",
"鐵道藝術村前身為臺東火車站，是原來臺東線的終點，2001年廢止後由位於卑南的臺東新站取代。後舊站幾經整修，將原來月台區整建成臺東鐵道藝術村，保留原來月台與鐵道的風貌<br><br>交通方式：台鐵臺東車站轉乘公車至台東轉運站下車後步行220公尺<br>住址：臺東縣臺東市鐵花路369號",
"交通方式：台鐵北迴線和平車站步行450公尺<br>住址：花蓮縣秀林鄉和平 263",
"交通方式：台鐵屏東線科工館車站徒步1.3公里<br>住址：高雄市三民區九如一路720號",
"今建築建於清乾隆五十二年（1787年），是臺灣台灣媽祖信仰的代表廟宇之一。每年的大甲媽祖遶境進香發展成臺灣民間信仰中最廣受歡迎注目的活動之一。<br><br>交通方式：台鐵海岸線大甲車站步行400公尺<br>住址：臺中市大甲區順天路158號",
"交通方式：台鐵縱貫線保安車站徒步650公尺<br>住址：台南市仁德區文華路二段66號",
"交通方式：台鐵臺中線豐富車站旁<br>住址：苗栗縣後龍鎮校椅里7鄰新港三路295號",
"交通方式：台鐵縱貫線崎頂車站步行800公尺<br>住址：苗栗縣竹南鎮崎頂里",
"位於彰化車站北方，隸屬彰化機務段，建於1922年（大正11年），現今開放予民眾參觀。庫房建物以調車轉盤為中心，呈十二股道放射狀形成一座半圓弧狀車庫。屬於台灣日治時期遺留下來的產物之一，目前為台灣唯一保存的扇形車庫。彰化機務段中的扇形車庫現今仍有維修車輛的作業持續進行中，並能見到車輛駛入轉車臺的運作<br><br>交通方式：台鐵縱貫線彰化車站徒步650公尺<br>住址：彰化縣彰化市彰美路1段1號",
"為新豐車站舊站房改建而成，為首間改建自舊火車站的門市，也是首間可於門市內觀看火車行駛而過的門市。新豐火車站前身設立於 1893 年，其中經歷過廢站、路線改善、改建等過程，於 1969 年正式命名為新豐站。新豐站原本是一座木造站房，1989 年改建為地上兩樓地下一樓的現代化建物，近年因應鄰近新竹工業區通勤旅客增加情況下，另於南邊 20 公尺外興建新火車站，並於 2014 年正式啟用。<br><br>交通方式：台鐵縱貫線新豐車站旁<br>住址：新竹縣新豐鄉新興路 202 號",
"傳說，施世榜開鑿八堡圳時，無法成功，有一位自稱姓林的老人，出面教導引水法才獲得成功，事成之後就神秘消失，後人就建廟祭拜。<br><br>交通方式：台鐵集集線源泉車站徒步400公尺",
"交通方式：台鐵縱貫線橋頭車站徒步700公尺<br>住址：高雄市橋頭區糖廠路24號",
"交通方式：台鐵太麻里車站步行650公尺",
"建於西元1927年，蛇窯源自大陸福州，由民間經營，故稱民窯，至於官窯則稱龍窯。蛇窯是順著斜坡地以土磚砌成，窯身甚長，遠望如蛇形，故名蛇窯。水里蛇窯是臺灣現有最古老、最具傳統鄉土文化的柴燒窯。<br><br>住址：南投縣水里鄉回窯路16號<br>交通方式：台鐵集集線水里車站轉搭豐榮客運至蛇窯站下",
"交通方式：台鐵臺東線池上車站步行280公尺<br>住址：台東縣池上鄉忠孝路259號",
"2012年開館，為臺灣兩座以海洋為主題的博物館，另一為屏東車城鄉的國立海洋生物博物館。<br><br>交通方式：台鐵深澳線海科館車站徒步400公尺<br>住址：基隆市中正區北寧路367號",
"深澳線被譽為臺灣最美海岸支線鐵道，2019年，台灣鐵路管理局與新北市政府合作的RAILBIKE啟用，使用深澳線停駛的八斗子站至深澳站區間，利用既有軌道設置鐵路自行車，全長1.3公里，可以在鐵軌上欣賞無敵海景。<br><br>交通方式：台鐵深澳線八斗子車站徒步140公尺<br>住址：新北市瑞芳區建基路二段121號",
"交通方式：台鐵宜蘭線礁溪車站步行700公尺<br>住址：宜蘭縣礁溪鄉德陽路99-11號",
"玉里大橋位處歐亞大陸板塊與菲律賓海板塊的接合處，受到板塊運動的擠壓，不僅使橋面隆起。由遠處觀看玉里大橋，在欄杆上呈現不等高的變形，每年以2至3公分速率仍持續上升當中，此景成為全台灣唯一僅存「會長高」的橋梁，也是全球唯二建造於斷層上的橋梁之一。由於橋面寬度過窄，只有來回各一線車道，沒有慢車道及路肩，後來於原橋旁另建一座橋梁，完工於1994年<br><br>交通方式：台鐵臺東線玉里車站轉乘1135公車至福安新村站下車後步行600公尺",
"交通方式：台鐵縱貫線社頭車站徒步450公尺<br>住址：彰化縣社頭鄉社斗路一段336號",
"交通方式：台鐵宜蘭線福隆車站步行850公尺<br>住址：新北市貢寮區福隆里興隆街40號",
"交通方式：台鐵宜蘭線羅東車站步行1公里<br>住址：宜蘭縣羅東鎮中正北路118號",
"交通方式：台鐵臺中線臺中車站旁<br>住址：台中市中區台灣大道一段1號",
"位於新北市平溪區菁桐車站外，該老街聚落興建於台灣日治時期的1937年，本為因礦業發跡街市，極盛時期有「菁桐坑銀座」之稱。1975年石底煤礦收坑後，菁桐老街便迅速沒落。菁桐老街今轉型以觀光攬客，因幾十年來未經翻修的屋舍呈現懷舊街景。",
"交通方式：台鐵縱貫線左營車站徒步500公尺<br>住址：高雄市左營區尾北里",
"交通方式：台鐵縱貫線台南車站徒步1.2公里<br>住址：台南市中西區民族路二段212號",
"建築為國定古蹟臺灣總督府鐵道部，1918年建，與臺北工場並存，成為南廳舍、北工廠配置，直到1934年臺北工場搬遷至松山（今國定古蹟臺北機廠）為止。<br><br>交通方式：台鐵縱貫線台北車站步行550公尺<br>住址：臺北市大同區延平北路一段2號",
"交通方式：台鐵縱貫線嘉義車站徒步1.4公里<br>住址：嘉義市東區林森西路2號"];
var idname1 = 0;

function tointro(){
    document.getElementById("carousel").style.opacity = "0";
    document.getElementById("carousel").style.zIndex = "0";
    document.getElementById("back").style.opacity = "0";
    document.getElementById("back").style.zIndex = "0";
    document.getElementById("introbox").style.opacity = "1";
    document.getElementById("introbox").style.zIndex = "1";
    document.getElementById("introbox").style.visibility = "visible";
}


function introin(x){
    idname1 = parseInt(x.id);
    document.getElementById("introbox_word").innerHTML = infor1[idname1];
    document.getElementById("introimg").src = "static/img/lsc/" + train[idname1] + ".jpg";
    tointro();
}