var station = ["三貂嶺車站","內獅車站","八斗子車站","勝興車站","合興車站","和仁車站","多良車站","大華車站","太麻里車站","山里車站","崎頂車站","成功車站","望古車站","枋山車站","牡丹車站","石城車站","石榴車站","石龜車站","追分車站","集集車站"];
var infor2 = ["為宜蘭線鐵路與平溪線鐵路之分歧點，是台灣唯一沒有道路可以直接抵達的鐵路車站，而是與鄰近的公路隔著基隆河相望。欲在本站搭車的旅客，必須自上游一段距離的鐵路橋處利用沿著鐵路線旁的人行步道跨越河床之後，徒步抵達本站。<br><br>住址：新北市瑞芳區碩仁里魚寮路1號",
"位於屏東縣枋山鄉，位於南迴線鐵路加祿與枋山站之間，運量每日僅一人左右，目前為臺鐵客運量最低的車站，未來規劃為恆春線的轉運站。<br><br>住址：屏東縣枋山鄉加祿村南和43號",
"八斗子車站位於基隆與瑞芳的交界處，是深澳支線今日的終點站，車站緊鄰東海，被譽為「北台灣的多良車站」。<br><br>住址：基隆市中正區砂子里",
"位於台灣苗栗縣三義鄉，為舊山線的鐵路車站，台鐵海拔最高的車站，標高402.326公尺1998年，因鐵路改線而裁撤，後於2010年舊山線復駛計劃而重新設站，目前有復駛的計劃。<br><br>住址：苗栗縣三義鄉勝興村勝興89號",
"位於新竹縣橫山鄉，，早期曾仰賴水泥原料的運送而紅極一時。台鐵一度打算廢站，後來一對夫妻出面認養舊車站，於是促成了合興車站的重生， 該站也因為這對夫妻的故事而聲名大噪，因而有「愛情火車站」的浪漫別名。車站保留古樸的日式木造建築、售票窗口擺設、多股軌道的遺跡和運送水泥原料的空中纜車。<br>「合興車站」還有一項非常特殊的設計，因為合興車站的鐵軌正線的位置適逢千分之25的上坡轉彎處，為了讓載重的貨物列車能安全停靠，故採用兩處「分離」月台的設計，並將車站擺在折返之處，是台灣少見的「折返式車站」。<br><br>住址：新竹縣橫山鄉中山街一段17號",
"住址：花蓮縣秀林鄉和平村和仁路71號",
"多良車站位於臺東縣太麻里鄉，位於南迴線鐵路瀧溪與金崙站之間，因站址原為山坡地，兩端均為隧道，南迴鐵路工程處特別將車站以高架設計，站在月台上即可鳥瞰太平洋，被鐵道迷認為是全臺灣最美的車站，但在2006年因業務清淡而廢站，由於旅客眾多，本站也預計於2024年恢復營運。<br><br>住址：臺東縣太麻里鄉多良村瀧溪8-1號<br>交通方式：台鐵南迴線金崙車站轉乘8135公車至多良站下車後步行210公尺",
"住址：新北市平溪區六分路12-1號",
"位於臺東縣太麻里鄉，號稱台灣最早看見日出的車站<br><br>住址：臺東縣太麻里鄉大王村276-13號",
"山里車站位於臺東縣卑南鄉，位於臺東線鐵路鹿野與臺東站之間，山里部落，1982年，因臺東線改線而設站，堪稱全台最偏僻的車站之一。<br><br>住址：臺東縣卑南鄉嘉豐村山里路108號",
"住址：苗栗縣竹南鎮崎頂里北戶55號",
"位於臺中市烏日區，因成追線兩端站名「追分成功」而聞名。<br><br>住址：臺中市烏日區榮泉里中山路三段550號",
"1972年，因應「慶和煤礦」的設立，以配合慶和煤礦之輸送；以及服務在慶和煤礦上下班的員工而設慶和招呼站，1989年改為望古站。<br>br>住址：新北市平溪區望古里",
"位於屏東縣獅子鄉，位於南迴線，本站是目前台灣最南端的鐵路車站。<br><br>住址：屏東縣獅子鄉內獅村內獅巷84號",
"位於宜蘭線鐵路三貂嶺與雙溪站之間，雙溪車站與牡丹車站之間為坡度千分之16的陡坡，牡丹車站剛好設置在鐵路著名的「牡丹坡」上。早年火車不如現在電氣化列車的有力，需採折返式車站的設計，列車到此站都得掛輔助機才能攀爬，後來為了解決坡度的問題，鐵路便以長度換取坡度，增加了火車行駛的長度距離，造就牡丹車站內有個120度大幅度的轉彎。<br><br>住址：新北市雙溪區牡丹里牡丹路159號",
"位於宜蘭縣頭城鎮，位於宜蘭線，本站是目前台灣最東端的鐵路車站。<br><br>住址：宜蘭縣頭城鎮石城里濱海路7段230號",
"住址：雲林縣斗六市榴北里文明路31號",
"住址：雲林縣斗南鎮石龜里",
"位於臺中市大肚區，因成追線兩端站名「追分成功」而聞名。<br><br>住址：臺中市大肚區王田里追分街13號",
"建於西元1933年，以純檜木建造，具古樸風格，係全臺古老火車站之一，為鐵路集集支線中之一站，已為觀光旅遊攝影景點。<br><br>住址：南投縣集集鎮民生路75號",];

var idname2 = 0;


function tointro2(){
    document.getElementById("carousel2").style.opacity = "0";
    document.getElementById("carousel2").style.zIndex = "0";
    document.getElementById("back2").style.opacity = "0";
    document.getElementById("back2").style.zIndex = "0";
    document.getElementById("introbox").style.opacity = "1";
    document.getElementById("introbox").style.zIndex = "3";
    document.getElementById("introbox").style.visibility = "visible";
}


function introin2(x){
    idname2 = parseInt(x.id);
    document.getElementById("introbox_word").innerHTML = infor2[idname2];
    document.getElementById("introimg").src = "static/img/station/" + station[idname2] + ".jpg";
    tointro2();
}